---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.Dispose
source: html/29acd183-7869-e155-1842-6a32ab108fd0.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.Dispose Method

Releases all resources used by the SchemaBuilder

## Syntax (C#)
```csharp
public void Dispose()
```